package JDBCPool;

/*
    数据库连接池
        1.概念：其实就是一个容器(集合)，存放数据库连接的容器
            当系统初始化好后，容器被创建，容器中会申请一些连接对象，当用户来访问数据库时，从容器中获取连接对象，用户访问完之后，会将连接对象归还给容器
        2.好处：
            1.节约资源
            2.用户访问高效
        3.实现：
            1.标准接口: DataSource javax.sql包
                方法：
                    *获取连接:getConnection()
                    *归还连接：Connection() 如果连接对象Connection是从连接池中获取的，那么调用Connection.close()方法，则不会再关闭连接了。而是归还连接

            2.一般我们不去实现它，有数据库厂商来实现
                1.c3p0：数据库连接池技术
                2.Druid：数据库连接池实现技术，由阿里巴巴提供


 */
public class JDBCPool01 {
}
