package Date;
/*
    java.util.Date表示日期和时间的类，类Date表示特定的瞬间，精确到毫秒即1000毫秒=1s
    特定的瞬间为一个时间点，一刹那时间如：2020-02-18-20：52：33：384
    毫秒值的作用：可以对时间和日期进行计算
    2020-02-18-20到1998-10-25中间一共有多少天
    可以日期转换为毫秒进行计算，计算完毕再把毫秒转换为日期

    把日期转换为毫秒：
        当前的日期：2020-02-18
        时间原点（0ms）：1970年1月1日00：00：00（英国格林威治）
        就是计算当前日期到时间原点之间一共经历了多少毫秒
    注意：
    中国属于东八区，会把时间增加8个小时
    1970年1月1日08：00：00

    把毫秒转换为日期
    1天 = 24 x 60 x 60 = 86400秒 = 86400000ms
 */

public class Date01 {
    public static void main(String[] args) {
        System.out.println(System.currentTimeMillis());//获取当前系统时间到1970年1月1日00：00：：00共经历了多少毫秒
    }
}
